content/public_lists/bots.md
+++
title = "Bots"
author = ["Hrishikesh Barman"]
draft = false
+++

<div class="outline-1 smol-table">

## Twitter bots {#twitter-bots}

Boi does twitter suck at most basic things, they successufullly managed to delete my collection of twitter list twice without any way to get that back. I have 0 trust on that site. So backing up my favorite bots here.

| Name                                                    | Description                                                                                                             |
|---------------------------------------------------------|-------------------------------------------------------------------------------------------------------------------------|
| [@awardthistweet](https://twitter.com/awardthistweet)   | A bot that awards.                                                                                                      |
| [@UAustinHistory](https://twitter.com/UAustinHistory)   | Parody, Teaching the forbidden, cancelled history you won't learn in woke history classes.                              |
| [@hnnocontext](https://twitter.com/hnnocontext)         | hot takes and tropes served fresh.                                                                                      |
| [@ResNeXtGuesser](https://twitter.com/ResNeXtGuesser)   | memes through a NN                                                                                                      |
| [@petfindernames](https://twitter.com/petfindernames)   | animals with unconventional names                                                                                       |
| [@SecureTheNews](https://twitter.com/SecureTheNews)     | Secure the News                                                                                                         |
| [@bcfridayguy](https://twitter.com/bcfridayguy)         | this munda (bot) reminds you to relax and have a fun weekend                                                            |
| [@pomological](https://twitter.com/pomological)         | bot tweeting random images from the pomological watercolor collection                                                   |
| [@postcards_past](https://twitter.com/postcards_past)   | captioning old postcards                                                                                                |
| [@256farben](https://twitter.com/256farben)             | painting in the style of Gerhard Richter's "color charts"                                                               |
| [@muslimbanca9](https://twitter.com/muslimbanca9)       | Bot tracking the Ninth Circuit's public mirror of the docket for State of Washington                                    |
| [@78_sampler](https://twitter.com/78_sampler)           | i'm an unofficial bot posting clips from the IA's great 78 project.                                                     |
| [@heartfeltbot](https://twitter.com/heartfeltbot)       | quotes                                                                                                                  |
| [@busteddealbot](https://twitter.com/busteddealbot)     | Bot tracking the docket of the Twitter v. Musk lawsuit                                                                  |
| [@i_remember_txt](https://twitter.com/i_remember_txt)   | I Remember (1975)                                                                                                       |
| [@ShitUserStory](https://twitter.com/ShitUserStory)     | I hope someday the owner realizes that using gradients in the images suck balls                                         |
| [@FrogandToadbot](https://twitter.com/FrogandToadbot)   | Tweets every 3 hours from Frog and Toad, books by Arnold Lobel.                                                         |
| [@_restaurant_bot](https://twitter.com/_restaurant_bot) | Random Restaurant                                                                                                       |
| [@CraigWeekend](https://twitter.com/CraigWeekend)       | daniel craig reminds you that the weekend is here, every friday evening                                                 |
| [@gone_things](https://twitter.com/gone_things)         | Things that are gone now                                                                                                |
| [@PlaguePoems](https://twitter.com/PlaguePoems)         | Sackcloth is always in style. (ig: plague_poems)                                                                        |
| [@auto_tweetcart](https://twitter.com/auto_tweetcart)   | runs PICO-8 code and responds with a video of the results!                                                              |
| [@bbcmicrobot](https://twitter.com/bbcmicrobot)         | Runs your tweet on a 1980s computer emu                                                                                 |
| [@ForestsWar](https://twitter.com/ForestsWar)           | Tracking deforestation one country at a time.                                                                           |
| [@whataweekhuh](https://twitter.com/whataweekhuh)       | Captain, it's wednesday                                                                                                 |
| [@GatorsDaily](https://twitter.com/GatorsDaily)         | #1 crocodilian influencer 🐊                                                                                            |
| [@DoesRecipe](https://twitter.com/DoesRecipe)           | Hi, I write recipes. If you @ me or reply to a tweet, I'll make a fresh recipe for you.                                 |
| [@RemindMe_OfThis](https://twitter.com/RemindMe_OfThis) | Ding dong⏰                                                                                                             |
| [@nntalebbot](https://twitter.com/nntalebbot)           | Bot that scrapes highlights from @nntaleb ’s Incerto collection.                                                        |
| [@Emoji_Ghadi](https://twitter.com/Emoji_Ghadi)         | The millennial child of @GhantaGhar. Tweets time for 🇮🇳                                                                 |
| [@BigTechAlert](https://twitter.com/BigTechAlert)       | Follow what the CEOs and other high executives from Big Tech companies do on Twitter.                                   |
| [@whalefact](https://twitter.com/awhalefact)            | whale fact for you.                                                                                                     |
| [@RoofSlappingBot](https://twitter.com/RoofSlappingBot) | \* slaps the roof of a bot \* this bad boy can fit so many assertions in it                                             |
| [@happyautomata](https://twitter.com/happyautomata)     | vaguely reassuring state machines                                                                                       |
| [@tiny_sat_party](https://twitter.com/tiny_sat_party)   | tiny satellites having tiny parties                                                                                     |
| [@apollo_50th](https://twitter.com/apollo_50th)         | Not affiliated with NASA. We live tweet the Apollo space program as it happened 50 years ago.                           |
| [@fckeveryword](https://twitter.com/fckeveryword)       | Fuck every word in the English language. Task did complete in 2020.                                                     |
| [@cantwithoutgoog](https://twitter.com/cantwithoutgoog) | Examples of how several websites depend on Google servers to function as intended.                                      |
| [@EffinBirds](https://twitter.com/EffinBirds)           | Britney Spears said I’m brilliant, fuck all y’all                                                                       |
| [@devmsg_txt](https://twitter.com/devmsg_txt)           | Bot posting real hidden messages left by developers in the code of their video games                                    |
| [@NYT_first_said](https://twitter.com/NYT_first_said)   | Tweets words when they appear in the New York Times for the first time.                                                 |
| [@badthingsdaily](https://twitter.com/badthingsdaily)   | This account tweets fictional or headline inspired breach scenarios.                                                    |
| [@ProfFeynman](https://twitter.com/ProfFeynman)         | A universe of atoms, an atom in the universe. Tribute to the great explainer.                                           |
| [@theyareaboutyou](https://twitter.com/theyareaboutyou) | If you want them to be about you, then they are.                                                                        |
| [@intenttoship](https://twitter.com/intenttoship)       | I tweet when browser makers announce their intent to ship, change or remove features in their web engines!              |
| [@cancel_stallman](https://twitter.com/cancel_stallman) | this bot was created with a humourous intent, but also out of respect to RMS. recent events have changed it all         |
| [@conceptsbot](https://twitter.com/conceptsbot)         | a bot that gives you various ideas. it talks back to you.                                                               |
| [@tinywordsmatter](https://twitter.com/tinywordsmatter) | A curated dose of ✍️ microcopy. Because tiny words matter!                                                               |
| [@choochoobot](https://twitter.com/choochoobot)         | A mighty locomotive sweeps through rugged landscapes.                                                                   |
| [@str_voyage](https://twitter.com/str_voyage)           | a bot forever voyaging. endless nautical story generator                                                                |
| [@simple_sabotage](https://twitter.com/simple_sabotage) | The contents of this Manual should be carefully controlled and should not be allowed to come into unauthorized hands.   |
| [@computerfact](https://twitter.com/computerfact)       | no one knows how computers work but now you can                                                                         |
| [@internetofshit](https://twitter.com/internetofshit)   | screw it, put a chip in it.                                                                                             |
| [@GoatUserStories](https://twitter.com/GoatUserStories) | I desire things - let me tell you about them.                                                                           |
| [@yayfrens](https://twitter.com/yayfrens)               | Hello! I am a loving friend bot!                                                                                        |
| [@BirdPerHour](https://twitter.com/BirdPerHour)         | birb pictures                                                                                                           |
| [@Classic_picx](https://twitter.com/Classic_picx)       | Some words with a picture underneath.                                                                                   |
| [@todayininfosec](https://twitter.com/todayininfosec)   | Tweeting news from the world of information security that occurred or was announced on today's date in a previous year. |
| [@tiny_star_field](https://twitter.com/tiny_star_field) | a small window of stars periodically throughout the day and night                                                       |
| [@TerribleMaps](https://twitter.com/TerribleMaps)       | The home of terrible maps with a pinch of humour                                                                        |
| [@EL_DIAGRAM](https://twitter.com/EL_DIAGRAM)           | Language, image, schematic since 2000. Publisher of lit, chapbooks, gear.                                               |
| [@KarlTheFog](https://twitter.com/KarlTheFog)           | All that is sunny does not glitter, not all those in the fog are lost.                                                  |

</div>

<div class="outline-1 smol-table">

## Reddit bots {#reddit-bots}

| Name                                                                                               | Description                                                                                     |
|----------------------------------------------------------------------------------------------------|-------------------------------------------------------------------------------------------------|
| [uselesconverterbot](https://www.reddit.com/r/UselessConversionBot/comments/1knas0/hi_im_useless/) | I look for useful and easy to share metric units and turn them into something more interesting. |
| [repost_sleuth_site](https://www.repostsleuth.com/)                                                | The Repost Detection Bot                                                                        |

</div>

<div class="outline-1 smol-table">

## Other bots {#other-bots}

| Name                                                   | Description                          |
|--------------------------------------------------------|--------------------------------------|
| [Talk to Books](https://books.google.com/talktobooks/) | Google's bot to talk to google books |

</div>
